
## Plan Result




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.prow_gatekeeper.kubectl_manifest.constraint_templates[&#34;apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \&#34;Privileged Container\&#34;\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: &gt;-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: &gt;-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: &gt;-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\&#34;msg\&#34;: msg, \&#34;details\&#34;: {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\&#34;Privileged container is not allowed: %v, securityContext: %v\&#34;, [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \&#34;parameters\&#34;, {}), \&#34;exemptImages\&#34;, [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \&#34;*\&#34;)\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \&#34;*\&#34;)\n              prefix := trim_suffix(exemption, \&#34;*\&#34;)\n              startswith(img, prefix)\n          }&#34;]
  * module.tekton_gatekeeper.kubectl_manifest.constraint_templates[&#34;apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \&#34;Privileged Container\&#34;\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: &gt;-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: &gt;-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: &gt;-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\&#34;msg\&#34;: msg, \&#34;details\&#34;: {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\&#34;Privileged container is not allowed: %v, securityContext: %v\&#34;, [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \&#34;parameters\&#34;, {}), \&#34;exemptImages\&#34;, [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \&#34;*\&#34;)\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \&#34;*\&#34;)\n              prefix := trim_suffix(exemption, \&#34;*\&#34;)\n              startswith(img, prefix)\n          }&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraint_templates[&#34;apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \&#34;Privileged Container\&#34;\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: &gt;-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: &gt;-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: &gt;-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\&#34;msg\&#34;: msg, \&#34;details\&#34;: {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\&#34;Privileged container is not allowed: %v, securityContext: %v\&#34;, [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \&#34;parameters\&#34;, {}), \&#34;exemptImages\&#34;, [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \&#34;*\&#34;)\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \&#34;*\&#34;)\n              prefix := trim_suffix(exemption, \&#34;*\&#34;)\n              startswith(img, prefix)\n          }&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    nanespaces: [\&#34;default\&#34;]\n  parameters:\n    exemptImages:\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraint_templates[&#34;apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \&#34;Privileged Container\&#34;\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: &gt;-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: &gt;-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: &gt;-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\&#34;msg\&#34;: msg, \&#34;details\&#34;: {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\&#34;Privileged container is not allowed: %v, securityContext: %v\&#34;, [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \&#34;parameters\&#34;, {}), \&#34;exemptImages\&#34;, [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \&#34;*\&#34;)\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \&#34;*\&#34;)\n              prefix := trim_suffix(exemption, \&#34;*\&#34;)\n              startswith(img, prefix)\n          }&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    nanespaces: [\&#34;default\&#34;]\n  parameters:\n    exemptImages:\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8spspprivilegedcontainer"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: Controls the ability of any container to enable privileged mode.
                  Corresponds to the `privileged` field in a PodSecurityPolicy. For more information,
                  see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                metadata.gatekeeper.sh/title: Privileged Container
                metadata.gatekeeper.sh/version: 1.0.0
              name: k8spspprivilegedcontainer
            spec:
              crd:
                spec:
                  names:
                    kind: K8sPSPPrivilegedContainer
                  validation:
                    openAPIV3Schema:
                      description: Controls the ability of any container to enable privileged
                        mode. Corresponds to the `privileged` field in a PodSecurityPolicy. For
                        more information, see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                      properties:
                        exemptImages:
                          description: |-
                            Any container that uses an image that matches an entry in this list will be excluded from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.
                            It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name) in order to avoid unexpectedly exempting images from an untrusted repository.
                          items:
                            type: string
                          type: array
                      type: object
              targets:
              - libs:
                - |-
                  package lib.exempt_container
            
                  is_exempt(container) {
                      exempt_images := object.get(object.get(input, "parameters", {}), "exemptImages", [])
                      img := container.image
                      exemption := exempt_images[_]
                      _matches_exemption(img, exemption)
                  }
            
                  _matches_exemption(img, exemption) {
                      not endswith(exemption, "*")
                      exemption == img
                  }
            
                  _matches_exemption(img, exemption) {
                      endswith(exemption, "*")
                      prefix := trim_suffix(exemption, "*")
                      startswith(img, prefix)
                  }
                rego: |
                  package k8spspprivileged
            
                  import data.lib.exempt_container.is_exempt
            
                  violation[{"msg": msg, "details": {}}] {
                      c := input_containers[_]
                      not is_exempt(c)
                      c.securityContext.privileged
                      msg := sprintf("Privileged container is not allowed: %v, securityContext: %v", [c.name, c.securityContext])
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.containers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.initContainers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.ephemeralContainers[_]
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8spspprivilegedcontainer"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: Controls the ability of any container to enable privileged mode.
                  Corresponds to the `privileged` field in a PodSecurityPolicy. For more information,
                  see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                metadata.gatekeeper.sh/title: Privileged Container
                metadata.gatekeeper.sh/version: 1.0.0
              name: k8spspprivilegedcontainer
            spec:
              crd:
                spec:
                  names:
                    kind: K8sPSPPrivilegedContainer
                  validation:
                    openAPIV3Schema:
                      description: Controls the ability of any container to enable privileged
                        mode. Corresponds to the `privileged` field in a PodSecurityPolicy. For
                        more information, see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                      properties:
                        exemptImages:
                          description: |-
                            Any container that uses an image that matches an entry in this list will be excluded from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.
                            It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name) in order to avoid unexpectedly exempting images from an untrusted repository.
                          items:
                            type: string
                          type: array
                      type: object
              targets:
              - libs:
                - |-
                  package lib.exempt_container
            
                  is_exempt(container) {
                      exempt_images := object.get(object.get(input, "parameters", {}), "exemptImages", [])
                      img := container.image
                      exemption := exempt_images[_]
                      _matches_exemption(img, exemption)
                  }
            
                  _matches_exemption(img, exemption) {
                      not endswith(exemption, "*")
                      exemption == img
                  }
            
                  _matches_exemption(img, exemption) {
                      endswith(exemption, "*")
                      prefix := trim_suffix(exemption, "*")
                      startswith(img, prefix)
                  }
                rego: |
                  package k8spspprivileged
            
                  import data.lib.exempt_container.is_exempt
            
                  violation[{"msg": msg, "details": {}}] {
                      c := input_containers[_]
                      not is_exempt(c)
                      c.securityContext.privileged
                      msg := sprintf("Privileged container is not allowed: %v, securityContext: %v", [c.name, c.securityContext])
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.containers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.initContainers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.ephemeralContainers[_]
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8spspprivilegedcontainer"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: Controls the ability of any container to enable privileged mode.
                  Corresponds to the `privileged` field in a PodSecurityPolicy. For more information,
                  see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                metadata.gatekeeper.sh/title: Privileged Container
                metadata.gatekeeper.sh/version: 1.0.0
              name: k8spspprivilegedcontainer
            spec:
              crd:
                spec:
                  names:
                    kind: K8sPSPPrivilegedContainer
                  validation:
                    openAPIV3Schema:
                      description: Controls the ability of any container to enable privileged
                        mode. Corresponds to the `privileged` field in a PodSecurityPolicy. For
                        more information, see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                      properties:
                        exemptImages:
                          description: |-
                            Any container that uses an image that matches an entry in this list will be excluded from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.
                            It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name) in order to avoid unexpectedly exempting images from an untrusted repository.
                          items:
                            type: string
                          type: array
                      type: object
              targets:
              - libs:
                - |-
                  package lib.exempt_container
            
                  is_exempt(container) {
                      exempt_images := object.get(object.get(input, "parameters", {}), "exemptImages", [])
                      img := container.image
                      exemption := exempt_images[_]
                      _matches_exemption(img, exemption)
                  }
            
                  _matches_exemption(img, exemption) {
                      not endswith(exemption, "*")
                      exemption == img
                  }
            
                  _matches_exemption(img, exemption) {
                      endswith(exemption, "*")
                      prefix := trim_suffix(exemption, "*")
                      startswith(img, prefix)
                  }
                rego: |
                  package k8spspprivileged
            
                  import data.lib.exempt_container.is_exempt
            
                  violation[{"msg": msg, "details": {}}] {
                      c := input_containers[_]
                      not is_exempt(c)
                      c.securityContext.privileged
                      msg := sprintf("Privileged container is not allowed: %v, securityContext: %v", [c.name, c.securityContext])
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.containers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.initContainers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.ephemeralContainers[_]
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    nanespaces: [\"default\"]\n  parameters:\n    exemptImages:\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sPSPPrivilegedContainer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "psp-privileged-container"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                nanespaces:
                - default
              parameters:
                exemptImages:
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8spspprivilegedcontainer"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: Controls the ability of any container to enable privileged mode.
                  Corresponds to the `privileged` field in a PodSecurityPolicy. For more information,
                  see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                metadata.gatekeeper.sh/title: Privileged Container
                metadata.gatekeeper.sh/version: 1.0.0
              name: k8spspprivilegedcontainer
            spec:
              crd:
                spec:
                  names:
                    kind: K8sPSPPrivilegedContainer
                  validation:
                    openAPIV3Schema:
                      description: Controls the ability of any container to enable privileged
                        mode. Corresponds to the `privileged` field in a PodSecurityPolicy. For
                        more information, see https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged
                      properties:
                        exemptImages:
                          description: |-
                            Any container that uses an image that matches an entry in this list will be excluded from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.
                            It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name) in order to avoid unexpectedly exempting images from an untrusted repository.
                          items:
                            type: string
                          type: array
                      type: object
              targets:
              - libs:
                - |-
                  package lib.exempt_container
            
                  is_exempt(container) {
                      exempt_images := object.get(object.get(input, "parameters", {}), "exemptImages", [])
                      img := container.image
                      exemption := exempt_images[_]
                      _matches_exemption(img, exemption)
                  }
            
                  _matches_exemption(img, exemption) {
                      not endswith(exemption, "*")
                      exemption == img
                  }
            
                  _matches_exemption(img, exemption) {
                      endswith(exemption, "*")
                      prefix := trim_suffix(exemption, "*")
                      startswith(img, prefix)
                  }
                rego: |
                  package k8spspprivileged
            
                  import data.lib.exempt_container.is_exempt
            
                  violation[{"msg": msg, "details": {}}] {
                      c := input_containers[_]
                      not is_exempt(c)
                      c.securityContext.privileged
                      msg := sprintf("Privileged container is not allowed: %v, securityContext: %v", [c.name, c.securityContext])
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.containers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.initContainers[_]
                  }
            
                  input_containers[c] {
                      c := input.review.object.spec.ephemeralContainers[_]
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    nanespaces: [\"default\"]\n  parameters:\n    exemptImages:\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sPSPPrivilegedContainer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "psp-privileged-container"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                nanespaces:
                - default
              parameters:
                exemptImages:
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor,
  on ../../../../development/terraform-executor/terraform/modules/k8s-terraform-executor/main.tf line 15, in resource "kubernetes_service_account" "terraform_executor":
  15: resource "kubernetes_service_account" "terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7779,"Program":"tfcmt","SHA1":"0cb87beed209c98c86d7beb06534b3ee559a68ba","Vars":{}} -->